/********************************************************************************
 *        Copyright(c) 2014-2016 Actions (Zhuhai) Technology Co., Limited,
 *                            All Rights Reserved.
 *
 * 描述：相对物理音量表定义，以0.1dB为单位。
 * 作者：cailizhen
 ********************************************************************************/

#include "common_ui_inner.h"

//负数，单位为0.1db
const int16 g_aud_vol_p1_db_table[VOLUME_VALUE_MAX + 1] =
{
    -1000, //vol 0  = mute
    -600, //vol 1  = -60  db
    -540, //vol 2
    -490, //vol 3
    -440, //vol 4
    -390, //vol 5
    -360, //vol 6
    -330, //vol 7
    -300, //vol 8
    -280, //vol 9
    -260, //vol 10
    -240, //vol 11
    -225, //vol 12
    -210, //vol 13
    -195, //vol 14
    -180, //vol 15
    -165, //vol 16
    -150, //vol 17
    -135, //vol 18
    -120, //vol 19
    -110, //vol 20
    -100, //vol 21
    -90, //vol 22
    -80, //vol 23
    -70, //vol 24
    -60, //vol 25
    -50, //vol 26
    -40, //vol 27
    -30, //vol 28
    -20, //vol 29
    -10, //vol 30
    0, //vol 31 = 0db
};

const int16 g_aud_vol_p1_db_call_table[VOLUME_VALUE_CALL_MAX + 1] =
{
    -440, //vol 0
    -400, //vol 1
    -360, //vol 2
    -320, //vol 3
    -280, //vol 4
    -240, //vol 5
    -210, //vol 6
    -180, //vol 7
    -150, //vol 8
    -120, //vol 9
    -100, //vol 10
    -80, //vol 11
    -60, //vol 12
    -40, //vol 13
    -20, //vol 14
    0, //vol 15 = 0db
};

//负数，单位为0.1db；USB音箱PC音量同步给小机
//适合WIN7操作系统的音量映射表
const int16 g_aud_vol_p1_db_pc_vol_table[101] =
{
    -1000, //vol 0  = mute
    -664, //vol 1  = -66  db
    -564, //vol 2
    -505, //vol 3
    -464, //vol 4
    -432, //vol 5
    -405, //vol 6
    -383, //vol 7
    -364, //vol 8
    -347, //vol 9
    -332, //vol 10
    -318, //vol 11
    -305, //vol 12
    -294, //vol 13
    -283, //vol 14
    -273, //vol 15
    -264, //vol 16
    -255, //vol 17
    -247, //vol 18
    -239, //vol 19
    -232, //vol 20
    -225, //vol 21
    -218, //vol 22
    -212, //vol 23
    -205, //vol 24
    -200, //vol 25
    -194, //vol 26
    -188, //vol 27
    -183, //vol 28
    -178, //vol 29
    -173, //vol 30
    -168, //vol 31
    -164, //vol 32
    -159, //vol 33
    -155, //vol 34
    -151, //vol 35
    -147, //vol 36
    -143, //vol 37
    -139, //vol 38
    -135, //vol 39
    -132, //vol 40
    -128, //vol 41
    -125, //vol 42
    -121, //vol 43
    -118, //vol 44
    -115, //vol 45
    -112, //vol 46
    -108, //vol 47
    -105, //vol 48
    -102, //vol 49
    -100, //vol 50
    -97, //vol 51
    -94, //vol 52
    -91, //vol 53
    -88, //vol 54
    -86, //vol 55
    -83, //vol 56
    -81, //vol 57
    -78, //vol 58
    -76, //vol 59
    -73, //vol 60
    -71, //vol 61
    -68, //vol 62
    -66, //vol 63
    -64, //vol 64
    -62, //vol 65
    -59, //vol 66
    -57, //vol 67
    -55, //vol 68
    -53, //vol 69
    -51, //vol 70
    -49, //vol 71
    -47, //vol 72
    -45, //vol 73
    -43, //vol 74
    -41, //vol 75
    -39, //vol 76
    -37, //vol 77
    -35, //vol 78
    -34, //vol 79
    -32, //vol 80
    -30, //vol 81
    -28, //vol 82
    -26, //vol 83
    -25, //vol 84
    -23, //vol 85
    -21, //vol 86
    -20, //vol 87
    -18, //vol 88
    -16, //vol 89
    -15, //vol 90
    -13, //vol 91
    -12, //vol 92
    -10, //vol 93
    -8, //vol 94
    -7, //vol 95
    -5, //vol 96
    -4, //vol 97
    -2, //vol 98
    -1, //vol 99
    0, //vol 100
};

#if 0
//适合XP操作系统的音量映射表
const int16 g_aud_vol_p1_db_pc_vol_table[101] =
{
    -1000, //vol 0  = mute
    -400, //vol 1  = -40  db
    -339, //vol 2
    -304, //vol 3
    -279, //vol 4
    -260, //vol 5
    -244, //vol 6
    -230, //vol 7
    -219, //vol 8
    -209, //vol 9
    -200, //vol 10
    -191, //vol 11
    -184, //vol 12
    -177, //vol 13
    -170, //vol 14
    -164, //vol 15
    -159, //vol 16
    -153, //vol 17
    -148, //vol 18
    -144, //vol 19
    -139, //vol 20
    -135, //vol 21
    -131, //vol 22
    -127, //vol 23
    -123, //vol 24
    -120, //vol 25
    -117, //vol 26
    -113, //vol 27
    -110, //vol 28
    -107, //vol 29
    -104, //vol 30
    -101, //vol 31
    -98, //vol 32
    -96, //vol 33
    -93, //vol 34
    -91, //vol 35
    -88, //vol 36
    -86, //vol 37
    -84, //vol 38
    -81, //vol 39
    -79, //vol 40
    -77, //vol 41
    -75, //vol 42
    -73, //vol 43
    -71, //vol 44
    -69, //vol 45
    -67, //vol 46
    -65, //vol 47
    -63, //vol 48
    -61, //vol 49
    -60, //vol 50
    -58, //vol 51
    -56, //vol 52
    -55, //vol 53
    -53, //vol 54
    -51, //vol 55
    -50, //vol 56
    -48, //vol 57
    -47, //vol 58
    -45, //vol 59
    -44, //vol 60
    -42, //vol 61
    -41, //vol 62
    -40, //vol 63
    -38, //vol 64
    -37, //vol 65
    -36, //vol 66
    -34, //vol 67
    -33, //vol 68
    -32, //vol 69
    -30, //vol 70
    -29, //vol 71
    -28, //vol 72
    -27, //vol 73
    -26, //vol 74
    -24, //vol 75
    -23, //vol 76
    -22, //vol 77
    -21, //vol 78
    -20, //vol 79
    -19, //vol 80
    -18, //vol 81
    -17, //vol 82
    -16, //vol 83
    -15, //vol 84
    -14, //vol 85
    -13, //vol 86
    -12, //vol 87
    -11, //vol 88
    -10, //vol 89
    -9, //vol 90
    -8, //vol 91
    -7, //vol 92
    -6, //vol 93
    -5, //vol 94
    -4, //vol 95
    -3, //vol 96
    -2, //vol 97
    -1, //vol 98
    0, //vol 99
    0, //vol 100
};
#endif

